//импорт анимированного компонента из react-native-reanimated
import animated from 'react-native-reanimated';

//компонент анимированного приветствия с волной
export function hellowave() {
  return (
    <animated.text
      style={{
        fontsize: 28,
        lineheight: 32,
        margintop: -6,
        //определение анимации с помощью css-подобного синтаксиса
        animationname: {
          '50%': { transform: [{ rotate: '25deg' }] }, //поворот на 25 градусов на середине анимации
        },
        animationiterationcount: 4, //анимация повторяется 4 раза
        animationduration: '300ms', //длительность одной итерации 300 миллисекунд
      }}>
      👋 
    </animated.text>
  );
}